{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "embedding_1_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3000], "dtype": "float32", "sparse": false, "name": "embedding_1_input"}, "inbound_nodes": []}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function": ["4wMAAAAAAAAACgAAAAQAAABTAAAAc4YAAAB0AGoBfACDAX0DfANkAGQBhQIZAH0EfANkAWQAhQIZ\nAH0FfAR8AhoAfQZ8AXwCZAEYAGsCckR8BHwGfAEUABgAfQduBHwGfQd0AGoCfAd8BWcCZAJkA40C\nfQd0AGoCfAZ8BWQCFABnAmQCZAONAn0IfAh8ARQAfQl0AGoDfAB8CXwHgwNTACkETukBAAAA6QAA\nAAApAdoEYXhpcykE2gFL2gVzaGFwZdoLY29uY2F0ZW5hdGXaBXNsaWNlKQraBGRhdGHaAWnaBXBh\ncnRzcgUAAADaCmJhdGNoX3NpemXaC2lucHV0X3NoYXBl2gRzdGVw2gRzaXpl2gZzdHJpZGXaBXN0\nYXJ0qQByEQAAAPpnL2hvbWUvZWMyLXVzZXIvYW5hY29uZGEzL2VudnMvdGVuc29yZmxvd19wMzYv\nbGliL3B5dGhvbjMuNi9zaXRlLXBhY2thZ2VzL2tlcmFzL3V0aWxzL211bHRpX2dwdV91dGlscy5w\nedoJZ2V0X3NsaWNltwAAAHMWAAAAAAEKAQwBDAEIAQwBDgIEARIBFgEIAQ==\n", null, null], "function_type": "lambda", "output_shape": [3000], "output_shape_type": "raw", "arguments": {"i": 0, "parts": 4}}, "inbound_nodes": [[["embedding_1_input", 0, 0, {}]]]}, {"name": "lambda_2", "class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "function": ["4wMAAAAAAAAACgAAAAQAAABTAAAAc4YAAAB0AGoBfACDAX0DfANkAGQBhQIZAH0EfANkAWQAhQIZ\nAH0FfAR8AhoAfQZ8AXwCZAEYAGsCckR8BHwGfAEUABgAfQduBHwGfQd0AGoCfAd8BWcCZAJkA40C\nfQd0AGoCfAZ8BWQCFABnAmQCZAONAn0IfAh8ARQAfQl0AGoDfAB8CXwHgwNTACkETukBAAAA6QAA\nAAApAdoEYXhpcykE2gFL2gVzaGFwZdoLY29uY2F0ZW5hdGXaBXNsaWNlKQraBGRhdGHaAWnaBXBh\ncnRzcgUAAADaCmJhdGNoX3NpemXaC2lucHV0X3NoYXBl2gRzdGVw2gRzaXpl2gZzdHJpZGXaBXN0\nYXJ0qQByEQAAAPpnL2hvbWUvZWMyLXVzZXIvYW5hY29uZGEzL2VudnMvdGVuc29yZmxvd19wMzYv\nbGliL3B5dGhvbjMuNi9zaXRlLXBhY2thZ2VzL2tlcmFzL3V0aWxzL211bHRpX2dwdV91dGlscy5w\nedoJZ2V0X3NsaWNltwAAAHMWAAAAAAEKAQwBDAEIAQwBDgIEARIBFgEIAQ==\n", null, null], "function_type": "lambda", "output_shape": [3000], "output_shape_type": "raw", "arguments": {"i": 1, "parts": 4}}, "inbound_nodes": [[["embedding_1_input", 0, 0, {}]]]}, {"name": "lambda_3", "class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "function": ["4wMAAAAAAAAACgAAAAQAAABTAAAAc4YAAAB0AGoBfACDAX0DfANkAGQBhQIZAH0EfANkAWQAhQIZ\nAH0FfAR8AhoAfQZ8AXwCZAEYAGsCckR8BHwGfAEUABgAfQduBHwGfQd0AGoCfAd8BWcCZAJkA40C\nfQd0AGoCfAZ8BWQCFABnAmQCZAONAn0IfAh8ARQAfQl0AGoDfAB8CXwHgwNTACkETukBAAAA6QAA\nAAApAdoEYXhpcykE2gFL2gVzaGFwZdoLY29uY2F0ZW5hdGXaBXNsaWNlKQraBGRhdGHaAWnaBXBh\ncnRzcgUAAADaCmJhdGNoX3NpemXaC2lucHV0X3NoYXBl2gRzdGVw2gRzaXpl2gZzdHJpZGXaBXN0\nYXJ0qQByEQAAAPpnL2hvbWUvZWMyLXVzZXIvYW5hY29uZGEzL2VudnMvdGVuc29yZmxvd19wMzYv\nbGliL3B5dGhvbjMuNi9zaXRlLXBhY2thZ2VzL2tlcmFzL3V0aWxzL211bHRpX2dwdV91dGlscy5w\nedoJZ2V0X3NsaWNltwAAAHMWAAAAAAEKAQwBDAEIAQwBDgIEARIBFgEIAQ==\n", null, null], "function_type": "lambda", "output_shape": [3000], "output_shape_type": "raw", "arguments": {"i": 2, "parts": 4}}, "inbound_nodes": [[["embedding_1_input", 0, 0, {}]]]}, {"name": "lambda_4", "class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "function": ["4wMAAAAAAAAACgAAAAQAAABTAAAAc4YAAAB0AGoBfACDAX0DfANkAGQBhQIZAH0EfANkAWQAhQIZ\nAH0FfAR8AhoAfQZ8AXwCZAEYAGsCckR8BHwGfAEUABgAfQduBHwGfQd0AGoCfAd8BWcCZAJkA40C\nfQd0AGoCfAZ8BWQCFABnAmQCZAONAn0IfAh8ARQAfQl0AGoDfAB8CXwHgwNTACkETukBAAAA6QAA\nAAApAdoEYXhpcykE2gFL2gVzaGFwZdoLY29uY2F0ZW5hdGXaBXNsaWNlKQraBGRhdGHaAWnaBXBh\ncnRzcgUAAADaCmJhdGNoX3NpemXaC2lucHV0X3NoYXBl2gRzdGVw2gRzaXpl2gZzdHJpZGXaBXN0\nYXJ0qQByEQAAAPpnL2hvbWUvZWMyLXVzZXIvYW5hY29uZGEzL2VudnMvdGVuc29yZmxvd19wMzYv\nbGliL3B5dGhvbjMuNi9zaXRlLXBhY2thZ2VzL2tlcmFzL3V0aWxzL211bHRpX2dwdV91dGlscy5w\nedoJZ2V0X3NsaWNltwAAAHMWAAAAAAEKAQwBDAEIAQwBDgIEARIBFgEIAQ==\n", null, null], "function_type": "lambda", "output_shape": [3000], "output_shape_type": "raw", "arguments": {"i": 3, "parts": 4}}, "inbound_nodes": [[["embedding_1_input", 0, 0, {}]]]}, {"name": "sequential_1", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 3000], "dtype": "float32", "input_dim": 1254, "output_dim": 128, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 3000}}, {"class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_1", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "layer": {"class_name": "CuDNNLSTM", "config": {"name": "cu_dnnlstm_1", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null}}, "merge_mode": "concat"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 41, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "inbound_nodes": [[["lambda_1", 0, 0, {}]], [["lambda_2", 0, 0, {}]], [["lambda_3", 0, 0, {}]], [["lambda_4", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Concatenate", "config": {"name": "dense_1", "trainable": true, "axis": 0}, "inbound_nodes": [[["sequential_1", 1, 0, {}], ["sequential_1", 2, 0, {}], ["sequential_1", 3, 0, {}], ["sequential_1", 4, 0, {}]]]}], "input_layers": [["embedding_1_input", 0, 0]], "output_layers": [["dense_1", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}