{"class_name": "Model", "config": {"name": "model_8", "layers": [{"name": "input_10", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3000], "dtype": "int32", "sparse": false, "name": "input_10"}, "inbound_nodes": []}, {"name": "embedding_10", "class_name": "Embedding", "config": {"name": "embedding_10", "trainable": true, "batch_input_shape": [null, 3000], "dtype": "float32", "input_dim": 1254, "output_dim": 512, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 3000}, "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"name": "spatial_dropout1d_10", "class_name": "SpatialDropout1D", "config": {"name": "spatial_dropout1d_10", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["embedding_10", 0, 0, {}]]]}, {"name": "bidirectional_10", "class_name": "Bidirectional", "config": {"name": "bidirectional_10", "trainable": true, "layer": {"class_name": "CuDNNLSTM", "config": {"name": "cu_dnnlstm_10", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "units": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0.0001, "max_value": 1.0, "rate": 1.0, "axis": 0}}, "recurrent_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0.0001, "max_value": 1.0, "rate": 1.0, "axis": 0}}, "bias_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0.0001, "max_value": 1.0, "rate": 1.0, "axis": 0}}}}, "merge_mode": "concat"}, "inbound_nodes": [[["spatial_dropout1d_10", 0, 0, {}]]]}, {"name": "attention_with_context_10", "class_name": "AttentionWithContext", "config": {"name": "attention_with_context_10", "trainable": true}, "inbound_nodes": [[["bidirectional_10", 0, 0, {}]]]}, {"name": "dense_8", "class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "units": 41, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0.0001, "max_value": 1.0, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["attention_with_context_10", 0, 0, {}]]]}], "input_layers": [["input_10", 0, 0]], "output_layers": [["dense_8", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}